STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/ROT/OEMiROT_Boot/Inc/flash_layout.h
/*
 * Copyright (c) 2018 Arm Limited. All rights reserved.
 * Copyright (c) 2024 STMicroelectronics. All rights reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef __FLASH_LAYOUT_H__
#define __FLASH_LAYOUT_H__

/* This header file is included from linker scatter file as well, where only a
 * limited C constructs are allowed. Therefore it is not possible to include
 * here the platform_retarget.h to access flash related defines. To resolve this
 * some of the values are redefined here with different names, these are marked
 * with comment.
 */

/* OEMiROT/OEMuROT configuration */
/*#define OEMUROT_ENABLE*/                 /* Do not edit. Automatically configured by
                                          ROT provisioning script, depending on bootpath selected.
                                          Defined: the project is used for OEMuRoT boot stage
                                          Undefined: the project is used for OEMiRoT boot stage */

/* Flash layout configuration : begin */
#if !defined (OEMUROT_ENABLE)
/*#define OEMIROT_FIRST_BOOT_STAGE*/ /* Undefined: the project is used to generate OEMiRoT for OEMiRoT boot path
                                        Defined: the project is used to generate OEMiRoT as first boot stage for OEMiRoT_OEMuRoT boot path */

/*#define OEMIROT_FIRST_BOOT_STAGE_FOR_SWAP*/   /* Defined: The first boot stage jump to oemurot in swap mode.
                                                   UnDefined: The first boot stage jump to oemurot in overwrite mode. */
#endif /* OEMUROT_ENABLE */

#define MCUBOOT_OVERWRITE_ONLY          /* Defined: the FW installation uses overwrite method.
                                           UnDefined: The FW installation uses swap mode. */

/*#define OEMIROT_EXTERNAL_FLASH_ENABLE*/   /* Defined: External OSPI flash used for all secondary slots.
                                               Undefined: External OSPI flash not used. */

#define MCUBOOT_APP_IMAGE_NUMBER 2      /* 1: S application only if FLASH_NS_PARTITION_SIZE = 0 ,
                                              else S and NS application binaries assembled in one single image.
                                           2: Two separated images for S and NS application binaries. */

#define MCUBOOT_S_DATA_IMAGE_NUMBER 0   /* 1: S data image for S application.
                                           0: No S data image. */

#define MCUBOOT_NS_DATA_IMAGE_NUMBER 0  /* 1: NS data image for NS application.
                                           0: No NS data image. */

/* Flash layout configuration : end */

/* Use secure OEMiRoT as first boot stage */
#if defined (OEMIROT_FIRST_BOOT_STAGE)
#undef MCUBOOT_APP_IMAGE_NUMBER
#undef MCUBOOT_S_DATA_IMAGE_NUMBER
#undef MCUBOOT_NS_DATA_IMAGE_NUMBER
#undef OEMIROT_EXTERNAL_FLASH_ENABLE
#define MCUBOOT_APP_IMAGE_NUMBER 1      /* App image contains OEMuRoT code. */
#define MCUBOOT_S_DATA_IMAGE_NUMBER 0   /* No S Data image for OEMuRoT. */
#define MCUBOOT_NS_DATA_IMAGE_NUMBER 0  /* No NS Data image for OEMuRoT. */
#endif /* OEMIROT_FIRST_BOOT_STAGE */

/* Total number of images */
#define MCUBOOT_IMAGE_NUMBER (MCUBOOT_APP_IMAGE_NUMBER + MCUBOOT_S_DATA_IMAGE_NUMBER + MCUBOOT_NS_DATA_IMAGE_NUMBER)

/* IMAGE_CODE_SIZE is the space available for the software binary image.
 * It is less than the FLASH_PARTITION_SIZE because we reserve space
 * for the image header and trailer introduced by the bootloader.
 */
#define BL2_HEADER_SIZE                         (0x400) /*!< Appli image header size */
#define BL2_DATA_HEADER_SIZE                    (0x20)  /*!< Data image header size */
#define BL2_TRAILER_SIZE                        (0x2000)

/* Use image hash reference to reduce boot time (signature check bypass) */
#define MCUBOOT_USE_HASH_REF

/* The size of a partition. This should be large enough to contain a S or NS
 * sw binary. Each FLASH_AREA_IMAGE contains two partitions. See Flash layout
 * above.
 */
#if  defined(OEMIROT_EXTERNAL_FLASH_ENABLE)
#define SPI_FLASH_DEV_NAME        Driver_SPI_FLASH0
#endif /* OEMIROT_EXTERNAL_FLASH_ENABLE */
#define FLASH_DEV_NAME             Driver_FLASH0

/* Flash layout info for BL2 bootloader */
#define FLASH_AREA_IMAGE_SECTOR_SIZE    (0x2000)     /* 8 KB */
#define FLASH_B_SIZE                    (0x100000)   /* 1 MBytes*/
#if defined(STM32WBA65xx)
#define FLASH_TOTAL_SIZE                (FLASH_B_SIZE + FLASH_B_SIZE) /* 2 MBytes */
#elif defined(STM32WBA52xx) || defined(STM32WBA55xx)
#define FLASH_TOTAL_SIZE                (FLASH_B_SIZE) /* 1 MBytes */
#else
#error "Unknown target."
#endif
#define FLASH_BASE_ADDRESS              (0x0c000000)

#if  defined(OEMIROT_EXTERNAL_FLASH_ENABLE)
/* External SPI Flash layout info for BL2 bootloader */
#define SPI_FLASH_TOTAL_SIZE           (0x400000)  /* 32 Mbits */
#define SPI_FLASH_BASE_ADDRESS         (0x00000000)

/* Flash device ID */
#define SPI_FLASH_DEVICE_ID            (FLASH_DEVICE_ID + 1) /* SPI Flash */
#endif /* OEMIROT_EXTERNAL_FLASH_ENABLE */

/* Flash area IDs */
#define FLASH_AREA_0_ID                 (1)
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
#define FLASH_AREA_1_ID                 (2)
#endif /* MCUBOOT_APP_IMAGE_NUMBER == 2 */
#if !defined(MCUBOOT_PRIMARY_ONLY)
#define FLASH_AREA_2_ID                 (3)
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
#define FLASH_AREA_3_ID                 (4)
#endif /* MCUBOOT_APP_IMAGE_NUMBER == 2 */
#endif /* MCUBOOT_PRIMARY_ONLY */
#if (MCUBOOT_S_DATA_IMAGE_NUMBER == 1)
#define FLASH_AREA_4_ID                 (5)
#endif /* MCUBOOT_S_DATA_IMAGE_NUMBER == 1 */
#if (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1)
#define FLASH_AREA_5_ID                 (6)
#endif /* MCUBOOT_NS_DATA_IMAGE_NUMBER == 1 */
#if !defined(MCUBOOT_PRIMARY_ONLY)
#if (MCUBOOT_S_DATA_IMAGE_NUMBER == 1)
#define FLASH_AREA_6_ID                 (7)
#endif /* MCUBOOT_S_DATA_IMAGE_NUMBER == 1 */
#if (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1)
#define FLASH_AREA_7_ID                 (8)
#endif /* MCUBOOT_NS_DATA_IMAGE_NUMBER == 1 */
#define FLASH_AREA_SCRATCH_ID           (9)
#endif /* MCUBOOT_PRIMARY_ONLY */

