STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/ROT/OEMiROT_Boot/Inc/flash_layout.h
/* Hardcoded value necessary for OEMiROT_OEMuROT : begin */
#if defined(OEMIROT_FIRST_BOOT_STAGE) || defined(OEMUROT_ENABLE)

/*
 * Those values are defined for OEMIROT_FIRST_BOOT_STAGE, but
 * we also need some of them for OEMuROT provisioning.
 */
#if defined(STM32WBA65xx)
#define OEMIROT_AREA_0_SIZE             (0x16000)       /* 88K */
#if defined(OEMIROT_FIRST_BOOT_STAGE_FOR_SWAP)
#define OEMIROT_AREA_1_SIZE             (0x1A4000)      /* 1680K */
#else
#define OEMIROT_AREA_1_SIZE             (0x1B4000)      /* 1744K */
#endif
#define OEMIROT_AREA_2_SIZE             (0x16000)       /* 88K */
#define OEMIROT_AREA_2_OFFSET           (0x1E8000)      /* slot 2 address when flash size: 2 MBytes */
#elif defined(STM32WBA52xx) || defined(STM32WBA55xx)
#define OEMIROT_AREA_0_SIZE             (0x16000)       /* 88K */
#if defined(OEMIROT_FIRST_BOOT_STAGE_FOR_SWAP)
#define OEMIROT_AREA_1_SIZE             (0xA4000)       /* 656K */
#else
#define OEMIROT_AREA_1_SIZE             (0xB4000)       /* 720K */
#endif
#define OEMIROT_AREA_2_SIZE             (0x16000)       /* 88K */
#define OEMIROT_AREA_2_OFFSET           (0xE8000)       /* slot 2 address when flash size: 1 MBytes */
#else
#error "Offset and size not defined for another target"
#endif
#define OEMIROT_AREA_BEGIN_OFFSET       (0x18000)
#define OEMIROT_AREA_BL2_OFFSET         (0x6000)
#define OEMIROT_BL2_WRP_START           (0x4000)

#endif  /* OEMIROT_FIRST_BOOT_STAGE || OEMUROT_ENABLE */
/* Hardcoded value necessary for OEMiROT_OEMuROT : end */

/* Offset and size definitions of the flash partitions that are handled by the
 * bootloader. The image swapping is done between IMAGE_0 and IMAGE_1, SCRATCH
 * is used as a temporary storage during image swapping.
 */
/* area for image HASH references */
#if defined (OEMUROT_ENABLE)
#define FLASH_HASH_REF_AREA_OFFSET      OEMIROT_AREA_BEGIN_OFFSET
#else
#define FLASH_HASH_REF_AREA_OFFSET      (0x0000)
#endif /* OEMUROT_ENABLE */
#if defined(MCUBOOT_USE_HASH_REF)
#define FLASH_HASH_REF_AREA_SIZE        (FLASH_AREA_IMAGE_SECTOR_SIZE)
#else
#define FLASH_HASH_REF_AREA_SIZE        (0x0000)
#endif /* MCUBOOT_USE_HASH_REF */

/* area for HUK and anti roll back counter */
#define FLASH_BL2_NVCNT_AREA_OFFSET     (FLASH_HASH_REF_AREA_OFFSET + FLASH_HASH_REF_AREA_SIZE)
#define FLASH_BL2_NVCNT_AREA_SIZE       (FLASH_AREA_IMAGE_SECTOR_SIZE)

/* scratch area */
#if defined(FLASH_AREA_SCRATCH_ID)
#define FLASH_AREA_SCRATCH_DEVICE_ID    (FLASH_DEVICE_ID - FLASH_DEVICE_ID)
#define FLASH_AREA_SCRATCH_OFFSET       (FLASH_BL2_NVCNT_AREA_OFFSET + FLASH_BL2_NVCNT_AREA_SIZE)
#if defined(MCUBOOT_OVERWRITE_ONLY)
#define FLASH_AREA_SCRATCH_SIZE         (0x0000) /* Not used in MCUBOOT_OVERWRITE_ONLY mode */
#else
#define FLASH_AREA_SCRATCH_SIZE         (0x10000) /* 64 KB */
#endif
/* control scratch area */
#if (FLASH_AREA_SCRATCH_OFFSET % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0
#error "FLASH_AREA_SCRATCH_OFFSET not aligned on FLASH_AREA_IMAGE_SECTOR_SIZE"
#endif /* (FLASH_AREA_SCRATCH_OFFSET % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0*/
#else /* FLASH_AREA_SCRATCH_ID */
#define FLASH_AREA_SCRATCH_SIZE         (0x0)
#endif /* FLASH_AREA_SCRATCH_ID */

/* personal area */
#define FLASH_AREA_PERSO_OFFSET         (FLASH_BL2_NVCNT_AREA_OFFSET + FLASH_BL2_NVCNT_AREA_SIZE + \
                                         FLASH_AREA_SCRATCH_SIZE)
#define FLASH_AREA_PERSO_SIZE           (0x2000)
/* control personal area */
#if (FLASH_AREA_PERSO_OFFSET % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0
#error "FLASH_AREA_PERSO_OFFSET not aligned on FLASH_AREA_IMAGE_SECTOR_SIZE"
#endif /* FLASH_AREA_PERSO_OFFSET % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0 */

/* area for BL2 code protected by hdp */
#define FLASH_AREA_BL2_OFFSET           (FLASH_AREA_PERSO_OFFSET+FLASH_AREA_PERSO_SIZE)
#if defined(OEMUROT_ENABLE)
#define FLASH_AREA_BL2_SIZE             (0x11C00)

/* Control area */
#if ((FLASH_AREA_BL2_SIZE + BL2_HEADER_SIZE + BL2_TRAILER_SIZE) % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0
#error "FLASH_AREA_BL2_SIZE not compatible with OEMIROT_AREA_0_SIZE"
#endif /* (FLASH_AREA_BL2_SIZE  % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0 */
#else /*OEMUROT_ENABLE */

#if !defined(MCUBOOT_OVERWRITE_ONLY)
#define FLASH_AREA_BL2_SIZE             (0x12000)
#else
#define FLASH_AREA_BL2_SIZE             (0x10000)
#endif
/* Control area */
#if (FLASH_AREA_BL2_SIZE  % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0
#error "FLASH_AREA_BL2_SIZE  not aligned on FLASH_AREA_IMAGE_SECTOR_SIZE"
#endif /* (FLASH_AREA_BL2_SIZE  % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0 */
#endif /*OEMUROT_ENABLE */

#if defined(OEMUROT_ENABLE)
/* HDP area end at this address */
#define FLASH_BL2_HDP_END               (FLASH_AREA_BL2_OFFSET + FLASH_AREA_BL2_SIZE + BL2_HEADER_SIZE -1)
/* area for BL2 code not protected by hdp */
#define FLASH_AREA_BL2_NOHDP_OFFSET     (FLASH_AREA_BL2_OFFSET + FLASH_AREA_BL2_SIZE + BL2_HEADER_SIZE)
#else /* OEMUROT_ENABLE */
/* HDP area end at this address */
#define FLASH_BL2_HDP_END               (FLASH_AREA_BL2_OFFSET + FLASH_AREA_BL2_SIZE -1)
/* area for BL2 code not protected by hdp */
#define FLASH_AREA_BL2_NOHDP_OFFSET     (FLASH_AREA_BL2_OFFSET + FLASH_AREA_BL2_SIZE)
#endif /* OEMUROT_ENABLE */
#define FLASH_AREA_BL2_NOHDP_SIZE       (FLASH_AREA_IMAGE_SECTOR_SIZE)
/* control area for BL2 code protected by hdp */
#if (FLASH_AREA_BL2_NOHDP_OFFSET % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0
#error "HDP area must be aligned on FLASH_AREA_IMAGE_SECTOR_SIZE"
#endif /* (FLASH_AREA_BL2_NOHDP_OFFSET % FLASH_AREA_IMAGE_SECTOR_SIZE) != 0 */

/* BL2 partitions size */
#if  defined(OEMIROT_FIRST_BOOT_STAGE)
/* For OEMIROT_FIRST_BOOT_STAGE we set 0 KB for NS partition */
#define FLASH_NS_PARTITION_SIZE         (0x0)

#else /* OEMIROT_FIRST_BOOT_STAGE */
#if defined(MCUBOOT_PRIMARY_ONLY)  || defined(TFM_COMPATIBILTY)
/* For PRIMARY_ONLY we need 512 KB for NS partition */
#define FLASH_NS_PARTITION_SIZE         (0x80000)

#else
/* For Others case, we limit the size to 200 KB for NS partition (except for FULL SECURE) */
#define FLASH_NS_PARTITION_SIZE         (0x32000)

#endif /* MCUBOOT_PRIMARY_ONLY || TFM_COMPATIBILTY */
#endif /* OEMIROT_FIRST_BOOT_STAGE */

